# Parameters
nc: 2  # number of classes
depth_multiple: 1.33 # model depth multiple
width_multiple: 1.25  # layer channel multiple
anchors:
# ucas 1024
  # - [31,33,  50,28,  31,55]
  # - [44,44,  64,34,  58,58]
  # - [73,73,  93,93,  125,120]

  # ucas 640
#   - [36,52,  72,39,  46,82]
#   - [67,68,  95,51,  88,88]
#   - [112,113,  147,147,  206,208]
    - [35,55,  73,40,  50,79]
    - [67,68,  88,63,  87,89]
    - [122,123,  160,154,  202,203]
  
# coco 640
  # - [10,13, 16,30, 33,23]  # P3/8
  # - [30,61, 62,45, 59,119]  # P4/16
  # - [116,90, 156,198, 373,326]  # P5/32



anchorsab:
#  - [10.098449,8.594835, 17.047703,15.820786, 23.246988,22.099531]
#  - [28.496862,29.530380, 35.671978,35.316532, 43.695770,39.073433]
#  - [52.065216,49.213512, 66.493553,61.970947, 79.836151,74.347153]
  # ucas 1024
  # - [65,165,  196,73,  397,55] 
  # - [118,227,  242,150,  211,266]
  # - [428,133,  332,232,  466,269]

  # ucas 640
  - [40,291,  144,109,  387,45]
  - [120,383,  425,134,  256,248]
  - [275,453,  493,272,  500,486]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2   320*320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4 # 12
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

# add
   [13, 1, Conv, [256, 1, 1]],  # 24
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 25
   [[-1, 4], 1, Concat, [1]],    # 26
   [-1, 3, C3, [256, False]],  # 27

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 30 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 33 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
   [[27, 30, 33], 1, Detect2, [nc, anchorsab]],  # Detect(P3, P4, P5)

  ]
