# Parameters
nc: 16  # number of classes
ft_coef: 4
lamda: 1.2
d0: 2.0

depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50  # layer channel multiple

anchors:
  # ucas 640
    # - [35,55,  73,40,  50,79]
    # - [67,68,  88,63,  87,89]
    # - [122,123,  160,154,  202,203]
  
# coco 640
  # - [10,13, 16,30, 33,23]  # P3/8
  # - [30,61, 62,45, 59,119]  # P4/16
  # - [116,90, 156,198, 373,326]  # P5/32

# dota 640
    # - [12,10,  14,25,  25,22]
    # - [27,43,  50,29,  47,52]
    # - [83,84,  161,173,  523,446]
# dota 768 anchor_t=6.0
      - [9,8,  17,18,  37,20]
      - [23,38,  38,38,  51,57]
      - [83,81,  148,161,  347,362]


anchorsab:
  # ucas 640
  # - [40,291,  144,109,  387,45]
  # - [120,383,  425,134,  256,248]
  # - [275,453,  493,272,  500,486]

# dota 640
  # - [131,78,  97,211,  412,59]
  # - [210,138,  425,105,  212,244]
  # - [394,174,  301,288,  484,291]
# dota 768 anchor_t=6
  - [53,441,  154,155,  432,58]
  - [160,533,  536,166,  306,304]
  - [327,583,  602,356,  593,607]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2   320*320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4 # 12
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

# add
   [13, 1, Conv, [256, 1, 1]],  # 24
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 25
   [[-1, 4], 1, Concat, [1]],    # 26
   [-1, 3, C3, [256, False]],  # 27

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 30 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 33 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
   [[27, 30, 33], 1, FTInfer, [ft_coef, lamda, d0, anchors]],  # FTInfer(P3, P4, P5)
  ]
